#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
/*
	写一个宏，可以将一个整数的二进制位的奇数位和偶数位交换
*/

/*
	思路：
	因为一个数字的值就是二进制位的每个 1 相加，所以
	把偶数位和奇数位分别提取出来
	将偶数位右移一位，奇数位左移一位，再相加
	即交换完成
	
	00000000000000000000000000001011 - 11
	01010101010101010101010101010101 - 按位与上这个数字即得到奇数位
	0x55555555 - 十六进制形式

	00000000000000000000000000001011 - 11
	10101010101010101010101010101010 - 按位与上这个数字即得到偶数位
	0xaaaaaaaa - 十六进制形式
*/

#define SWAP(x) (((x&0x55555555)<<1) + ((x&0xaaaaaaaa)>>1))
int main()
{
	int a = 11;
	printf("%d\n", SWAP(a));
	return 0;
}