#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>


/*
有一个整数序列（可能有重复的整数），现删除指定的某一个整数，输出删除指定数字之后的序列，序列中未被删除数字的前后位置没有发生改变。
数据范围：序列长度和序列中的值都满足n大于等于1小于等于50
输入描述：
第一行输入一个整数(0≤N≤50)。
第二行输入N个整数，输入用空格分隔的N个整数。
第三行输入想要进行删除的一个整数。
输出描述：
输出为一行，删除指定数字之后的序列。
*/



/*
    思路：准备两个变量，将其中的一个坐标赋值给另一个坐标
    然后将其中的一个变量在将要被删除的下标滞后另一个
*/

int main() 
{
    int arr[50] = { 0 };
    int n = 0;
    int i = 0;
    int temp = 0;
    scanf("%d", &n);
    for (i = 0; i < n; i++)
    {
        scanf("%d", &arr[i]);
    }
    int d = 0;
    scanf("%d", &d);
    int j = 0;

    //将i赋值给j
    for (i = 0; i < n; i++)
    {
        if (arr[i] != d)
        {
            arr[j++] = arr[i];
        }
    }

    //这里打印时，j因为遍历除删除以外的数字，所以用j来控制循环
    for (i = 0; i < j; i++)
    {
        printf("%d ", arr[i]);
    }
    return 0;
}